drlfoam/openfoam/test_cases/rotatingPinball2D/pinball_re100_attention/Allrun
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# run case
runParallel pimpleFoam
touch finished.txt

#------------------------------------------------------------------------------
