drlfoam/openfoam/test_cases/rotatingPinball2D/pinball_re100_attention/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("${DRL_LIBBIN}/libPinballRotatingWallVelocity.so");

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3.0;

//deltaT          0.01;

deltaT          5.0e-3;

//writeControl    adjustableRunTime;

writeControl    runTime;

writeInterval   1.0;

//purgeWrite      0;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

//adjustTimeStep yes;

//maxDeltaT 0.01;

//maxCo 1.0;

//runTimeModifiable true;

runTimeModifiable false;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        executeInterval 100;
        //writeControl    writeTime;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       3;
        log yes;
        writeFields     yes;

        patches
        (
            cylinders
        );
	coefficients    (Cd Cl);
        rhoInf      1;
        rho         rhoInf;

        CofR        (-0.433 0.0 0.0);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        //pitchAxis   (0 0 1);
        magUInf     1.0;
        lRef        2.5;
        Aref        0.05;
    }
    
    field_cylinder_a
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forceCoeff);
        //writeControl    timeStep;
        //executeControl  timeStep;
        //executeInterval 2;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       3;
        operation       sum;
        regionType      faceZone;
        name            faceZone_a;
        weightField     none;
        writeFields     yes;
        surfaceFormat   raw;

    }

    field_cylinder_b
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forceCoeff);
        //writeControl    timeStep;
        //writeControl    writeTime;
        //executeControl  timeStep;
        //executeInterval 2;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       3;
        operation       sum;
        regionType      faceZone;
        name            faceZone_b;
        weightField     none;
        writeFields     yes;
        surfaceFormat   raw;

    }
    field_cylinder_c
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forceCoeff);
        //writeControl    timeStep;
        //writeControl    writeTime;
        //executeControl  timeStep;
        //executeInterval 2;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       3;
        operation       sum;
        regionType      faceZone;
        name            faceZone_c;
        weightField     none;
        writeFields     yes;
        surfaceFormat   raw;

    }

    probes
    {
        type            probes;
        libs            (sampling);

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        executeControl  timeStep;
        executeInterval 100;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       3.0;

        // Fields to be probed
        fields          (p);

        // Optional: do not recalculate cells if mesh moves
        fixedLocations  true;

        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cell;

        probeLocations
        (
		(0.75000 -2.50000 0.005)
		(0.75000 -2.00000 0.005)
		(0.75000 -1.50000 0.005)
		(0.75000 -1.00000 0.005)
		(0.75000 -0.50000 0.005)
		(0.75000 0.00000 0.005)
		(0.75000 0.50000 0.005)
		(0.75000 1.00000 0.005)
		(0.75000 1.50000 0.005)
		(0.75000 2.00000 0.005)
		(0.75000 2.50000 0.005)
		(1.00000 -2.50000 0.005)
		(1.00000 -2.00000 0.005)
		(1.00000 -1.50000 0.005)
		(1.00000 -1.00000 0.005)
		(1.00000 -0.50000 0.005)
		(1.00000 0.00000 0.005)
		(1.00000 0.50000 0.005)
		(1.00000 1.00000 0.005)
		(1.00000 1.50000 0.005)
		(1.00000 2.00000 0.005)
		(1.00000 2.50000 0.005)
		(1.25000 -2.50000 0.005)
		(1.25000 -2.00000 0.005)
		(1.25000 -1.50000 0.005)
		(1.25000 -1.00000 0.005)
		(1.25000 -0.50000 0.005)
		(1.25000 0.00000 0.005)
		(1.25000 0.50000 0.005)
		(1.25000 1.00000 0.005)
		(1.25000 1.50000 0.005)
		(1.25000 2.00000 0.005)
		(1.25000 2.50000 0.005)
		(1.50000 -2.50000 0.005)
		(1.50000 -2.00000 0.005)
		(1.50000 -1.50000 0.005)
		(1.50000 -1.00000 0.005)
		(1.50000 -0.50000 0.005)
		(1.50000 0.00000 0.005)
		(1.50000 0.50000 0.005)
		(1.50000 1.00000 0.005)
		(1.50000 1.50000 0.005)
		(1.50000 2.00000 0.005)
		(1.50000 2.50000 0.005)
		(2.00000 -2.50000 0.005)
		(2.00000 -2.00000 0.005)
		(2.00000 -1.50000 0.005)
		(2.00000 -1.00000 0.005)
		(2.00000 -0.50000 0.005)
		(2.00000 0.00000 0.005)
		(2.00000 0.50000 0.005)
		(2.00000 1.00000 0.005)
		(2.00000 1.50000 0.005)
		(2.00000 2.00000 0.005)
		(2.00000 2.50000 0.005)
		(2.50000 -2.50000 0.005)
		(2.50000 -2.00000 0.005)
		(2.50000 -1.50000 0.005)
		(2.50000 -1.00000 0.005)
		(2.50000 -0.50000 0.005)
		(2.50000 0.00000 0.005)
		(2.50000 0.50000 0.005)
		(2.50000 1.00000 0.005)
		(2.50000 1.50000 0.005)
		(2.50000 2.00000 0.005)
		(2.50000 2.50000 0.005)
		(3.00000 -2.50000 0.005)
		(3.00000 -2.00000 0.005)
		(3.00000 -1.50000 0.005)
		(3.00000 -1.00000 0.005)
		(3.00000 -0.50000 0.005)
		(3.00000 0.00000 0.005)
		(3.00000 0.50000 0.005)
		(3.00000 1.00000 0.005)
		(3.00000 1.50000 0.005)
		(3.00000 2.00000 0.005)
		(3.00000 2.50000 0.005)
		(3.50000 -2.50000 0.005)
		(3.50000 -2.00000 0.005)
		(3.50000 -1.50000 0.005)
		(3.50000 -1.00000 0.005)
		(3.50000 -0.50000 0.005)
		(3.50000 0.00000 0.005)
		(3.50000 0.50000 0.005)
		(3.50000 1.00000 0.005)
		(3.50000 1.50000 0.005)
		(3.50000 2.00000 0.005)
		(3.50000 2.50000 0.005)
		(4.00000 -2.50000 0.005)
		(4.00000 -2.00000 0.005)
		(4.00000 -1.50000 0.005)
		(4.00000 -1.00000 0.005)
		(4.00000 -0.50000 0.005)
		(4.00000 0.00000 0.005)
		(4.00000 0.50000 0.005)
		(4.00000 1.00000 0.005)
		(4.00000 1.50000 0.005)
		(4.00000 2.00000 0.005)
		(4.00000 2.50000 0.005)
...
        );

        // Optional: filter out points that haven't been found. Default
        //           is to include them (with value -VGREAT)
        includeOutOfBounds  false;
    }

}

// ************************************************************************* //
